jtec/flightcode/code/hardwareAccessLayer/stm32_bits.h
// BIT DEFINITION: e.g. 0x00000004 = 0b00000000000000000000000000000100

#define   BIT0        0x00000001
#define   BIT1        0x00000002
#define   BIT2        0x00000004
#define   BIT3        0x00000008
#define   BIT4        0x00000010
#define   BIT5        0x00000020
#define   BIT6        0x00000040
#define   BIT7        0x00000080
#define   BIT8        0x00000100
#define   BIT9        0x00000200
#define   BIT10       0x00000400
#define   BIT11       0x00000800
#define   BIT12       0x00001000
#define   BIT13       0x00002000
#define   BIT14       0x00004000
#define   BIT15       0x00008000
#define   BIT16       0x00010000
#define   BIT17       0x00020000
#define   BIT18       0x00040000
#define   BIT19       0x00080000
#define   BIT20       0x00100000
#define   BIT21       0x00200000
#define   BIT22       0x00400000
#define   BIT23       0x00800000
#define   BIT24       0x01000000
#define   BIT25       0x02000000
#define   BIT26       0x04000000
#define   BIT27       0x08000000
#define   BIT28       0x10000000
#define   BIT29       0x20000000
#define   BIT30       0x40000000
#define   BIT31       0x80000000


// Pin definition used to access set GPIO levels: e.g. 0x00000004 = 0b00000000000000000000000000000100
// e.g. GPIOx->BSRR |= PIN4;

#define   PIN0        0x00000001
#define   PIN1        0x00000002
#define   PIN2        0x00000004
#define   PIN3        0x00000008
#define   PIN4        0x00000010
#define   PIN5        0x00000020
#define   PIN6        0x00000040
#define   PIN7        0x00000080
#define   PIN8        0x00000100
#define   PIN9        0x00000200
#define   PIN10       0x00000400
#define   PIN11       0x00000800
#define   PIN12       0x00001000
#define   PIN13       0x00002000
#define   PIN14       0x00004000
#define   PIN15       0x00008000
#define   PIN16       0x00010000
#define   PIN17       0x00020000
#define   PIN18       0x00040000
#define   PIN19       0x00080000
#define   PIN20       0x00100000
#define   PIN21       0x00200000
#define   PIN22       0x00400000
#define   PIN23       0x00800000
#define   PIN24       0x01000000
#define   PIN25       0x02000000
#define   PIN26       0x04000000
#define   PIN27       0x08000000
#define   PIN28       0x10000000
#define   PIN29       0x20000000
#define   PIN30       0x40000000
#define   PIN31       0x80000000
